Docs: Add Mermaid Diagrams to Docs Page (#242)
* add mermaid support for docs

* add mermaid flow diagrams for client VMs

* update CLAUDE.md to have correct definition about in_use status

* add mermaid diagrams for database

* add mermaid diagrams for deployment

* update docs with the latest change in vms table

* Modify contributing docs to recommend the use of mermaid diagrams

* update docs with more accurate information

* update trigger with correct info
